Repository: mumu-lhl/Ciyue
Catalog: lib/l10n/app_*.arb
Languages: bn

# addDictionary
source: Please add a MDX dictionary in the settings first
bn: অনুগ্রহপূর্বক সেটিংস থেকে প্রথমে একটি MDX অভিধান যুক্ত করুন

# startToSearch
source: Start going on a word search :)
bn: শব্দ খুঁজতে শুরু করুন

source: Manage Dictionaries
bn: অভিধান পরিচালনা করুন

source: Home
bn: হোমপেজ

source: Word Book
bn: শব্দকোষ

source: Settings
bn: সেটিংস

# permissionDenied
source: You have to grant the permissions
bn: আপনাকে অনুমতি দিতে হবে

source: Close
bn: বন্ধ করুন

source: Search
bn: খুঁজুন

source: Theme
bn: দৃশ্য-ধরন

source: Light
bn: উজ্জ্বল

source: Dark
bn: অনুজ্জ্বল

source: System
bn: রীতিমতো

source: Language
bn: ভাষা

source: Lookup
bn: শব্দার্থ খুঁজুন

source: Not found
bn: পাওয়া যায় নি

# notSupport
source: Not support this MDX file
bn: এই MDX ফাইলটি সমর্থন যোগ্য নয়

source: Copy
bn: কপি করুন

# readLoudly
source: Read Aloud
bn: উচ্চস্বরে পড়ুন

source: Feedback
bn: প্রতিক্রিয়া

source: Copied
bn: কপি করা হয়েছে

source: Export
bn: রপ্তানি করুন

source: Import
bn: আমদানি করুন

source: Empty...
bn: খালি…

source: Add
bn: যোগ করুন

source: Auto Export
bn: স্বয়ংক্রিয় রপ্তানি

source: Tags
bn: চিরকুটসমূহ

source: Remove
bn: অপসারণ

source: Confirm
bn: নিশ্চিত করুন

source: No Result
bn: ফলাফল শূন্য

source: Description
bn: বিবরণ

source: Properties
bn: বৈশিষ্ট্যসমূহ

# removeOneHistory
source: Remove History
bn: ইতিহাস মুছুন

# removeOneHistoryConfirm
source: Are you sure you want to remove '%s' from history?
bn: আপনি কি নিশ্চিত আপনি '{word}' কে ইতিহাস থেকে মুছে ফেলতে চান?

source: Clear History
bn: ইতিহাস পরিষ্কার করুন

# clearHistoryConfirm
source: Are you sure you want to clear history?
bn: আপনি কি নিশ্চিত আপনি ইতিহাস পরিষ্কার করতে চান?

source: Default
bn: স্বাভাবিক

source: Manage Groups
bn: শ্রেণী গুলো পরিচালনা করুন

source: Export File Name
bn: রপ্তানিকৃত ফাইলের নাম

source: Export Directory
bn: রপ্তানির ঠিকানা

source: Title
bn: শিরোনাম

source: Total Number of Entries
bn: লিপিভুক্তিকরণের মোট সংখ্যা

source: Sponsor
bn: পৃষ্ঠপোষক

source: More
bn: আরো

source: Auto Remove Search Word
bn: খোঁজকৃত শব্দ স্বয়ংক্রিয়ভাবে মুছুন

# secureScreen
source: Anti-Screenshot
bn: স্ক্রিনশট বিরোধিতা

source: Search Bar Location
bn: সার্চবারের অবস্থান

source: Top
bn: উপরে

source: Bottom
bn: নিচে

source: Sidebar Icon
bn: সাইডবারের অবস্থান

source: Export Path
bn: রপ্তানির রাস্তা

source: Edit Word
bn: শব্দ পরিবর্তন

source: Notification
bn: প্রজ্ঞাপন

source: More Options Button
bn: আরো পছন্দের বোতাম

source: Title Alias
bn: শিরোনামের উপনাম

source: Skip Tagged Word
bn: চিরকুটভুক্ত শব্দ এড়িয়ে যান

source: Dictionary Groups
bn: অভিধান শ্রেনীসমূহ

source: Appearance
bn: বাহ্য রূপ

source: Privacy
bn: গোপনীয়তা

source: Privacy Policy
bn: গোপনীয়তা নীতি

source: AI Settings
bn: কৃত্রিম বুদ্ধিমত্তা সেটিংস

source: AI Provider
bn: কৃত্রিম বুদ্ধিমত্তা প্রদানকারী

source: API Key
bn: API চাবি

source: Output Type
bn: ফলাফলের ধরন

source: AI Explain Word
bn: AI শব্দ ব্যাখ্যা

source: History
bn: ইতিহাস

source: AI Model
bn: কৃত্রিম বুদ্ধিমত্তার মডেল

source: Tag List
bn: চিরকুট তালিকা

# updateAnnouncement
source: The Announcement of Updating to %s
bn: {version} এ উত্তরণের ঘোষণা

# recommendedDictionaries
source: Recommmended Dictionaries
bn: সুপারিশকৃত অভিধানসমূহ

source: Tag Name
bn: চিরকুটের নাম

source: Add Tag
bn: চিরকুট যোগ করুন

source: Custom Font
bn: বিশেষায়িত হরফ

source: Rich Output
bn: পরিপূর্ণ ফলাফল

source: Simple Output
bn: সরল ফলাফল

source: Translate
bn: অনুবাদ করুন

source: Source Language
bn: মূল ভাষা

source: Target Language
bn: ফলাফলের ভাষা

source: Auto Detect
bn: স্বয়ংক্রিয় সনাক্ত

source: Check for Updates
bn: হালনাগাদের জন্য খোঁজ করুন

# updateAvailableContent
source: New version %s is available. Do you want to update?
bn: নতুন সংস্করণ {version} আছে। আপনি কি হালনাগাদ করতে চান?

source: Update
bn: হালনাগাদ করুন

source: No update available
bn: কোন সাম্প্রতিক সংস্করণ পাওয়া যায় নি

source: Update Available
bn: সাম্প্রতিক সংস্করণ পাওয়া গেছে

# updateCheckFailed
source: Check update failed
bn: সাম্প্রতিক সংস্করণ খোঁজ বিফল হয়েছে

# includePrerelease
source: Include Prerelease Updates
bn: প্রাক-প্রকাশ সংস্করণ অন্তর্ভুক্ত করুন

source: Checking for updates...
bn: হালনাগাদের জন্য খোঁজা হচ্ছে..।

source: Enter text to translate
bn: অনুবাদ করতে লিখুন

source: Terms of Service
bn: পরিষেবার শর্তাবলী

# aiExplainWordPrompt
source: Explain Word Prompt
bn: শব্দ ব্যাখ্যার অনুরোধ

source: Prompt Mode
bn: অনুরোধ মোড

# customOption
source: Custom
bn: স্বনির্বাচিত

source: Custom Explain Prompt
bn: স্বনির্বাচিত ব্যাখ্যার অনুরোধ

# customExplainPromptHelper
source: You can use $word and $targetLanguage in your prompt.
bn: আপনি আপনার অনুরোধে $word এবং $targetLanguage ব্যবহার করতে পারেন।

source: AI Translate Prompt
bn: এআই অনুবাদ অনুরোধ

source: Custom Translate Prompt
bn: স্বনির্বাচিত অনুবাদ অনুরোধ

# customTranslatePromptHelper
source: You can use $sourceLanguage, $targetLanguage, and $text in your prompt.
bn: আপনি আপনার অনুরোধে $sourceLanguage, $targetLanguage এবং $text ব্যবহার করতে পারেন।

# tabBarPosition
source: TabBar Position in Word Display
bn: শব্দ প্রদর্শনে ট্যাববার অবস্থান

# showSearchBarInWordDisplayPage
source: Show Search Bar in Word Display
bn: শব্দ প্রদর্শনে সার্চ বার দেখান

source: Auto Update
bn: স্বয়ংক্রিয় হালনাগাদ

# legacyImport
source: Import (Legacy, will be removed in future)
bn: উত্তরাধিকার আমদানি (ভবিষ্যতে সরানো হবে)

source: Audio Settings
bn: অডিও সেটিংস

source: TTS Engines
bn: টিটিএস ইঞ্জিন

source: TTS Languages
bn: টিটিএস ভাষা

source: Floating Window
bn: ভাসমান উইন্ডো

source: Loading...
bn: লোড হচ্ছে...

# addingWord
source: Adding Word: %s
bn: শব্দ যোগ করা হচ্ছে: {word}

source: Copying Files...
bn: ফাইল কপি করা হচ্ছে...

# addingResource
source: Adding Resource: %s
bn: সম্পদ যোগ করা হচ্ছে: {resource}
